Repository: AMOUHOUB0/imc
Catalog: lib/l10n/app_*.arb
Languages: ar, es, fr

# appTitle
source: BMI CALCULATOR
ar: حاسبة مؤشر كتلة الجسم
es: CALCULADORA IMC
fr: CALCULATEUR IMC

# weight
source: Weight (Kg)
ar: الوزن (كجم)
es: Peso (Kg)
fr: Poids (Kg)

# height
source: Height (cm)
ar: الطول (سم)
es: Altura (cm)
fr: Taille (cm)

source: Calculate
ar: احسب
es: Calcular
fr: Calculer

# reportData
source: Report your data
ar: أدخل بياناتك
es: Reporta tus datos
fr: Renseignez vos données

# insertWeight
source: Insert your weight!
ar: أدخل وزنك!
es: ¡Inserta tu peso!
fr: Insérez votre poids!

# insertHeight
source: Insert your height!
ar: أدخل طولك!
es: ¡Inserta tu altura!
fr: Insérez votre taille!

source: View History
ar: عرض السجل
es: Ver historial
fr: Voir l'historique

source: Language
ar: اللغة
es: Idioma
fr: Langue

# underweightSevere
source: Severely Underweight
ar: نقص وزن حاد
es: Bajo peso severo
fr: Insuffisance pondérale sévère

# underweightModerate
source: Moderately Underweight
ar: نقص وزن متوسط
es: Bajo peso moderado
fr: Insuffisance pondérale modérée

# underweightMild
source: Mildly Underweight
ar: نقص وزن خفيف
es: Bajo peso leve
fr: Insuffisance pondérale légère

source: Normal
ar: طبيعي

source: Overweight
ar: زيادة الوزن
es: Sobrepeso
fr: Surpoids

# obeseI
source: Obese Class I
ar: سمنة من الدرجة الأولى
es: Obesidad clase I
fr: Obésité classe I

# obeseII
source: Obese Class II
ar: سمنة من الدرجة الثانية
es: Obesidad clase II
fr: Obésité classe II

# obeseIII
source: Obese Class III
ar: سمنة من الدرجة الثالثة
es: Obesidad clase III
fr: Obésité classe III

source: BMI History
ar: سجل مؤشر كتلة الجسم
es: Historial de IMC
fr: Historique IMC

source: Loading...
ar: جار التحميل...
es: Cargando...
fr: Chargement...

source: Error loading data
ar: خطأ في تحميل البيانات
es: Error al cargar datos
fr: Erreur de chargement des données

# noBmiResults
source: No BMI results found
ar: لم يتم العثور على نتائج مؤشر كتلة الجسم
es: No se encontraron resultados de IMC
fr: Aucun résultat IMC trouvé

source: BMI
ar: مؤشر كتلة الجسم
es: IMC
fr: IMC

source: Result
ar: النتيجة
es: Resultado
fr: Résultat

source: Date
ar: التاريخ
es: Fecha

source: Underweight
ar: نقص الوزن
es: Bajo peso
fr: Insuffisance pondérale

source: Obese
ar: السمنة
es: Obesidad
fr: Obésité

# signInTitle
source: Sign in to your account
ar: تسجيل الدخول إلى حسابك
es: Inicia sesión en tu cuenta
fr: Connectez-vous à votre compte

# resetPasswordTitle
source: Reset your password
ar: إعادة تعيين كلمة المرور الخاصة بك
es: Restablece tu contraseña
fr: Réinitialisez votre mot de passe

# viewGraph
source: View Graphs
ar: عرض الرسوم البيانية
es: Ver gráficos
fr: Voir les graphiques

source: BMI Evolution
ar: تطور مؤشر كتلة الجسم
es: Evolución del IMC
fr: Évolution de l'IMC

source: BMI Tips
ar: نصائح مؤشر كتلة الجسم
es: Consejos IMC
fr: Conseils IMC

source: Your BMI Evolution
ar: تطور مؤشر كتلة الجسم الخاص بك
es: Tu evolución del IMC
fr: Votre évolution IMC

# bmiAdviceTitle
source: Tips for Your BMI
ar: نصائح لمؤشر كتلة الجسم الخاص بك
es: Consejos para tu IMC
fr: Conseils pour ton IMC

source: Close
ar: إغلاق
es: Cerrar
fr: Fermer

source: Your BMI
ar: مؤشر كتلة الجسم الخاص بك
es: Tu IMC
fr: Votre IMC

source: BMI Target
ar: الهدف لمؤشر كتلة الجسم
es: Objetivo IMC
fr: Objectif IMC

# bmiNoData
source: No BMI data available.
ar: لا توجد بيانات لمؤشر كتلة الجسم.
es: No hay datos de IMC disponibles.
fr: Aucune donnée IMC disponible.

# bmiUnderweight1
source: 🍞 Eat more frequently and in sufficient amounts.
ar: 🍞 تناول الطعام بشكل أكثر تواترًا وبكميات كافية.
es: 🍞 Come más a menudo y en cantidades suficientes.
fr: 🍞 Mange plus souvent et en quantité suffisante.

# bmiUnderweight2
source: 💪 Eat foods rich in healthy calories.
ar: 💪 تناول الأطعمة الغنية بالسعرات الحرارية الصحية.
es: 💪 Come alimentos ricos en calorías saludables.
fr: 💪 Alimente-toi avec des produits riches en calories saines.

# bmiUnderweight3
source: 🏋️‍♂️ Engage in light activities to stimulate appetite.
ar: 🏋️‍♂️ مارس نشاطًا بدنيًا خفيفًا لتحفيز الشهية.
es: 🏋️‍♂️ Realiza actividades suaves para estimular el apetito.
fr: 🏋️‍♂️ Pratique une activité douce pour stimuler l'appétit.

# bmiNormal1
source: ✅ You're in the normal range, keep it up!
ar: ✅ أنت ضمن المعدل الطبيعي، استمر هكذا!
es: ✅ Estás dentro del rango normal, ¡sigue así!
fr: ✅ Tu es dans la norme, continue comme ça !

# bmiNormal2
source: 🥗 Maintain a balanced diet.
ar: 🥗 حافظ على نظام غذائي متوازن.
es: 🥗 Mantén una dieta equilibrada.
fr: 🥗 Maintiens une alimentation équilibrée.

# bmiNormal3
source: 🏃‍♀️ Stay physically active regularly.
ar: 🏃‍♀️ حافظ على نشاط بدني منتظم.
es: 🏃‍♀️ Mantén una actividad física regular.
fr: 🏃‍♀️ Garde une activité physique régulière.

# bmiOverweight1
source: 🥦 Reduce fatty/sugary foods.
ar: 🥦 قلل من الأطعمة الدهنية/السكرية.
es: 🥦 Reduce los alimentos grasos/azucarados.
fr: 🥦 Réduis les aliments gras/sucrés.

# bmiOverweight2
source: 🚶‍♀️ Move a little more each day.
ar: 🚶‍♀️ تحرك أكثر قليلاً كل يوم.
es: 🚶‍♀️ Muévete un poco más cada día.
fr: 🚶‍♀️ Bouge un peu plus chaque jour.

# bmiOverweight3
source: 🧘‍♂️ Manage your stress, sleep well.
ar: 🧘‍♂️ ادير توترك، ونم جيدًا.
es: 🧘‍♂️ Controla tu estrés, duerme bien.
fr: 🧘‍♂️ Gère ton stress, dors bien.

# bmiObese1
source: 📉 Try to lose weight gradually.
ar: 📉 حاول فقدان الوزن تدريجيًا.
es: 📉 Intenta perder peso gradualmente.
fr: 📉 Essaie de perdre du poids progressivement.

# bmiObese2
source: 🍲 Seek advice from a professional.
ar: 🍲 استشر مختصًا.
es: 🍲 Consulta a un profesional.
fr: 🍲 Demande conseil à un professionnel.

# bmiObese3
source: 🚴‍♂️ Start a light exercise routine regularly.
ar: 🚴‍♂️ ابدأ نشاطًا بدنيًا خفيفًا بانتظام.
es: 🚴‍♂️ Comienza una actividad física ligera regularmente.
fr: 🚴‍♂️ Commence une activité douce régulièrement.
